Tekla.Structures.DialogInternal.UnitHelper
Unit helper

Tekla.Structures.DialogInternal.UnitHelper.GetUnitLabel(Tekla.Structures.Dialog.dotdiaUnitTypes_e)
Get unit label
type: Unit type
Returns: The unit label (null if not successful).

Tekla.Structures.DialogInternal.UnitHelper.GetUnitDecimals(Tekla.Structures.Dialog.dotdiaUnitTypes_e)
Get unit decimal count.
type: Unit type
Returns: The unit decimal count.

Tekla.Structures.DialogInternal.UnitHelper.SetUnitDecimals(Tekla.Structures.Dialog.dotdiaUnitTypes_e,System.Int32)
Set unit decimals.
type: Unit type
count: Decimal count
Returns: True if succesfull.

Tekla.Structures.DialogInternal.UnitHelper.FormatDoubleUnitValue(System.Double,Tekla.Structures.Dialog.dotdiaUnitTypes_e,System.Boolean)
Format value as string in the currently selected unit.
value: Value (always in the fixed unit specified for the unit type)
type: Unit type
includeLabel: True if unit label to be included in the string
Returns: The formatted value (null if not successful).

Tekla.Structures.DialogInternal.UnitHelper.ParseDoubleUnitValue(System.String,Tekla.Structures.Dialog.dotdiaUnitTypes_e)
Parse value from string which represents value in currently selected unit.
Possible trailing unit label in the string is ignored.
Example: If currently selected length unit is cm,
all of these are parsed to the same value 200 (mm): "20", "20 cm", "20 mm".
stringValue: String value
type: Unit type
Returns: The parsed value (in the fixed unit specified for the unit type).

Tekla.Structures.DialogInternal.UnitHelper.SetUnitDecimalsForModelingUnits(Tekla.Structures.Dialog.dotdiaUnitTypes_e,System.Int32)
Set unit decimals for modeling units for Fusion features.
type: Unit type
count: Decimal count
Returns: The unit decimal count.

Tekla.Structures.DialogInternal.UnitHelper.SetAdvancedOption(System.String,System.Int32)
Set advanced option int value.
name: Unit name
value: Decimal count